from app.db.models.place import Tag
from app.db.repositories.tag import TagRepository
from app.domain.entities.tag import Tag as TagEntity

class TagService:
    def __init__(self, tag_repo: TagRepository):
        self.tag_repo = tag_repo
    
    def create_tag(self):
        names: list[str] = [
        # Type
        "ресторан","кафе","кофейня","бар","паб","клуб","столовая","фастфуд","пиццерия","бургерная","суши-бар",
        "кондитерская","пекарня","кальянная","винный бар","коктейль-бар","караоке","фудкорт","гастробар",
        # Cuisine
        "русская","европейская","итальянская","французская","испанская","греческая","американская","мексиканская",
        "латиноамериканская","грузинская","армянская","турецкая","ближневосточная","израильская","азиатская",
        "китайская","японская","корейская","тайская","вьетнамская","индийская","паназиатская","средиземноморская",
        # Drinks & specialization
        "кофе-спешиалти","кофе-to-go","чайная","bubble tea","крафтовое пиво","пивоварня","вино","дегустации",
        "авторские коктейли","настойки","безалкогольные коктейли",
        # Diet
        "вегетарианское","веганское","безглютеновое","безлактозное","халяль","кошер","постное меню","здоровое питание",
        # Occasions
        "завтрак","бранч","бизнес-ланч","ужин","поздний ужин","свидание","с друзьями","семейное","день рождения",
        "банкет","корпоратив","мероприятия","живая музыка","квизы","настольные игры",
        # Atmosphere
        "уютно","тихо","шумно","романтично","панорамный вид","терраса","камин","современно","лофт","атмосферно",
        "авторская кухня","необычный интерьер",
        # Work
        "можно с ноутбуком","много розеток","быстрый Wi-Fi","коворкинг-зона","тихая зона","удобные столы",
        # Family
        "детское меню","детская комната","детские стульчики","подходит с коляской","семейные столы",
        # Accessibility & comfort
        "доступная среда","безбарьерный вход","лифт","туалет для маломобильных","кондиционер","гардероб",
        "оплата картой","оплата QR","бронирование","доставка","самовывоз",
        # Pets
        "pet-friendly","миска для воды","можно с собакой",
        ]
        self.tag_repo.fill(names)
    
    def get_all_tags(self) -> list[TagEntity]:
        dd = self.tag_repo.get_all()
        return dd

    def get_by_name(self, name: str) -> TagEntity:
        dd = self.tag_repo.get_by_name(name)
        return dd

    def get_by_id(self, id: int) -> TagEntity:
        dd = self.tag_repo.get_by_id(id)
        return dd